#### Terraform prod Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.media_api.data.archive_file.get_upload_records: Reading...
module.media_api.data.archive_file.create_upload_record: Reading...
module.media_api.data.archive_file.delete_upload_record: Reading...
module.media_api.data.archive_file.delete_upload_record: Read complete after 0s [id=ad78493de890359b4d1003e7cdcdba6d2259efed]
module.media_api.data.archive_file.create_upload_record: Read complete after 0s [id=a51dbe4cf464ec26863e2d4e942225f93b208cf1]
module.media_api.data.archive_file.get_upload_records: Read complete after 0s [id=e9a0b6a33c61a6b08b45ecafd251e206b74f25ee]
module.identity_pool.data.aws_region.current: Reading...
module.media_api.data.aws_caller_identity.current: Reading...
module.media_api.data.aws_region.current: Reading...
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_ArZMchMfd]
module.media_storage.data.aws_caller_identity.current: Reading...
module.media_api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.identity_pool.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_storage.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_storage.aws_s3_bucket.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_api.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=mr95jbqfkm13eqgjrh505qi56]
module.identity_pool.aws_cognito_identity_pool.main: Refreshing state... [id=ap-northeast-1:e4973375-0e3b-4da1-990f-3bf9ed0c9e6f]
module.identity_pool.aws_iam_role.authenticated: Refreshing state... [id=cloud-photos-cognito-authenticated-prod]
module.identity_pool.aws_cognito_identity_pool_roles_attachment.main: Refreshing state... [id=ap-northeast-1:e4973375-0e3b-4da1-990f-3bf9ed0c9e6f]
module.identity_pool.aws_iam_role_policy.authenticated_s3: Refreshing state... [id=cloud-photos-cognito-authenticated-prod:media-storage-access]
module.media_storage.aws_s3_bucket_versioning.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_storage.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_storage.aws_s3_bucket_public_access_block.media: Refreshing state... [id=***-cloud-photos-media-prod]
module.media_storage.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=***-cloud-photos-media-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.media_api.aws_api_gateway_deployment.media will be created
  + resource "aws_api_gateway_deployment" "media" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "ap-northeast-1"
      + rest_api_id  = (known after apply)
      + triggers     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.delete_upload will be created
  + resource "aws_api_gateway_integration" "delete_upload" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.get_uploads will be created
  + resource "aws_api_gateway_integration" "get_uploads" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.post_uploads will be created
  + resource "aws_api_gateway_integration" "post_uploads" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_method.delete_upload will be created
  + resource "aws_api_gateway_method" "delete_upload" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.media_api.aws_api_gateway_method.get_uploads will be created
  + resource "aws_api_gateway_method" "get_uploads" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.media_api.aws_api_gateway_method.post_uploads will be created
  + resource "aws_api_gateway_method" "post_uploads" {
      + api_key_required = false
      + authorization    = "AWS_IAM"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.media_api.aws_api_gateway_resource.media will be created
  + resource "aws_api_gateway_resource" "media" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "media"
      + region      = "ap-northeast-1"
      + rest_api_id = (known after apply)
    }

  # module.media_api.aws_api_gateway_resource.upload_item will be created
  + resource "aws_api_gateway_resource" "upload_item" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{mediaId}"
      + region      = "ap-northeast-1"
      + rest_api_id = (known after apply)
    }

  # module.media_api.aws_api_gateway_resource.uploads will be created
  + resource "aws_api_gateway_resource" "uploads" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "uploads"
      + region      = "ap-northeast-1"
      + rest_api_id = (known after apply)
    }

  # module.media_api.aws_api_gateway_rest_api.media will be created
  + resource "aws_api_gateway_rest_api" "media" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "cloud-photos-media-api-prod"
      + policy                       = (known after apply)
      + region                       = "ap-northeast-1"
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.media_api.aws_api_gateway_stage.media will be created
  + resource "aws_api_gateway_stage" "media" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "ap-northeast-1"
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["create_upload_record"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-prod-create-upload-record"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["delete_upload_record"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-prod-delete-upload-record"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_cloudwatch_log_group.lambda["get_upload_records"] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/cloud-photos-prod-get-upload-records"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
    }

  # module.media_api.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-photos-prod-media-api-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.media_api.aws_iam_role_policy.lambda_dynamodb will be created
  + resource "aws_iam_role_policy" "lambda_dynamodb" {
      + id          = (known after apply)
      + name        = "dynamodb-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_iam_role_policy.lambda_logs will be created
  + resource "aws_iam_role_policy" "lambda_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.media_api.aws_lambda_function.create_upload_record will be created
  + resource "aws_lambda_function" "create_upload_record" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/create_upload_record.zip"
      + function_name                  = "cloud-photos-prod-create-upload-record"
      + handler                        = "create_upload_record.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "boptoGty3M+/5ZYj6MBZrMq7hV/wiYAiF1UWTJGYllM="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-upload-records-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.delete_upload_record will be created
  + resource "aws_lambda_function" "delete_upload_record" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/delete_upload_record.zip"
      + function_name                  = "cloud-photos-prod-delete-upload-record"
      + handler                        = "delete_upload_record.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "SDLshP6ezomWs9TlPyJqSYAxGJQMzEbKiuMcfEttut4="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-upload-records-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.get_upload_records will be created
  + resource "aws_lambda_function" "get_upload_records" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/get_upload_records.zip"
      + function_name                  = "cloud-photos-prod-get-upload-records"
      + handler                        = "get_upload_records.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "hwsThoxXK4FRi7NKq494Xc3ZOtdFkx3AIsFIEi0Ym1s="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-upload-records-prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_permission.delete_upload will be created
  + resource "aws_lambda_permission" "delete_upload" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-prod-delete-upload-record"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.get_uploads will be created
  + resource "aws_lambda_permission" "get_uploads" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-prod-get-upload-records"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.post_uploads will be created
  + resource "aws_lambda_permission" "post_uploads" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-prod-create-upload-record"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_db.aws_dynamodb_table.upload_records will be created
  + resource "aws_dynamodb_table" "upload_records" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = true
      + hash_key                    = "userId"
      + id                          = (known after apply)
      + name                        = "cloud-photos-upload-records-prod"
      + range_key                   = "mediaId"
      + read_capacity               = (known after apply)
      + region                      = "ap-northeast-1"
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "mediaId"
          + type = "S"
        }
      + attribute {
          + name = "userId"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + media_api_endpoint        = (known after apply)
  + upload_records_table_name = "cloud-photos-upload-records-prod"
Releasing state lock. This may take a few moments...

```

</details>


**Stderr:**
```

Error: Invalid count argument

  on ../../modules/identity_pool/main.tf line 79, in resource "aws_iam_role_policy" "authenticated_api":
  79:   count = var.api_execution_arn != "" ? 1 : 0

The "count" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the count depends on.

```
<!-- terraform-plan-prod -->